cask_args appdir: "/Applications"
cask "alfred"
cask "alt-tab"

# background-music is alternative for Soundflower
# cask "background-music"

# Bluesnooze prevents your sleeping Mac from connecting to Bluetooth accessories.
cask "bluesnooze"
cask "chromium", args: { 'no-quarantine': true }
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "fork"
cask "focus"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "hyper"
cask "imhex"
cask "inkscape"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "mimestream"
cask "mutify"
cask "ngrok"
cask "obs"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
# cannot install
# cask "soundflower"
cask "sublime-text"
cask "ticktick"
cask "visual-studio-code"
# cask "rectangle"
cask "warp"

brew "agg"
brew "asciinema"
brew "asdf"

# brew tap axiomhq/tap
brew "axiom"

brew "bazel"
brew "bitwarden-cli"
brew "coreutils"
brew "deno"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "git-lfs"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "golang-migrate"
brew "gpg"
brew "grpcurl"
brew "helm"
brew "hexyl"
brew "htop"
brew "imagemagick"
brew "jq"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "libpq"

# brew tap felangel/mason
brew "mason"

brew "mas"
brew "mysql"
# Install failed
# brew "meetingbar"
brew "neovim"
brew "watch"

# Upstream sunsetted 1.x in March 2016 and 2.x is not open-source.
# If you wish to use the 2.x release you can install it with:
#  brew install --cask ngrok
# brew "ngrok"
brew "peco"
brew "rsync"
brew "starship"
brew "protobuf"
brew "sheldon"
# brew tap shellspec/shellspec
brew "shellspec"
brew "stern"
brew "rg"
brew "rustup"
brew "terraform"
brew "tmux"
brew "wasm-pack"
brew "wget"
# brew "vim"

mas "Bitwarden", id: 1352778147
mas "Craft", id: 1487937127
mas "Daisy Disk", id: 411643860
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "LadioCast", id: 411213048
mas "Magnet", id: 441258766
# mas "MeetingBar", id: 1532419400
mas "MKPlayer", id: 1335612105
mas "The Unarchiver", id: 425424353

# Affinity Designer is installed from Website
# mas "Affinity Designer", id: 1274090551

# install Rosetta2
# sudo softwareupdate --install-rosetta

# https://gist.github.com/mbinna/2357277
# defaults write NSGlobalDomain ApplePressAndHoldEnabled -bool false
# defaults write NSGlobalDomain KeyRepeat -int 1
# defaults write NSGlobalDomain InitialKeyRepeat -int 12

# defaults write com.apple.systemaudio "com.apple.sound.uiaudio.enabled" -bool NO

# https://apple.stackexchange.com/questions/431812/how-can-i-stop-a-bluetooth-keyboard-from-waking-my-macbook-pro
# Disallow Blootooth devices to wake this computer
# defaults -currentHost write com.apple.Bluetooth RemoteWakeEnabled 0
